# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np
from numpy.random import randint

In [2]:
# criando colunas e índices
columns = ['W', 'X', 'Y', 'Z'] # four columns
index = ['A', 'B', 'C', 'D', 'E'] # five rows

In [3]:
# randint retorna inteiros aleatórios de acordo com a range e o shape atribuído
np.random.seed(42)
data = randint(-100,100,(5,4))

In [4]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [9]:
# criando DF com os índices e colunas específicos
df = pd.DataFrame(data, index, columns)

In [10]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

# Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

# COLUMNS

## Grab a single column

In [12]:
# única coluna
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [13]:
df.X

A    79
B   -29
C    21
D    -1
E    49
Name: X, dtype: int64

In [14]:
# mais de uma coluna
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

### Creating a new column:

In [25]:
# nova coluna sendo a soma de outras duas
df['new'] = df['W'] + df['Y']

In [26]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

## Removing Columns

In [27]:
# axis = 1, pq é uma coluna
df.drop('new',axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [28]:
# não apaga permanentemente
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [29]:
# inserindo o inplace
df.drop('new',axis=1, inplace=True)

In [30]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

## Working with Rows

## Selecting one row by name

In [32]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

## Selecting multiple rows by name

In [33]:
df.loc[['A','C']]

   W   X   Y   Z
A  2  79  -8 -86
C  2  21 -26 -13

## Select single row by integer index location

In [34]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

## Select multiple rows by integer index location

In [35]:
df.iloc[0:2]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80

## Remove row by name

In [36]:
# axis = 0 é defaltu
df.drop('C',axis=0)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [37]:
# não apaga permanentemente 
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [38]:
# podemos reatribuir a remoção: método indicado, inplace cairá em desuso futuramente
df = df.drop('E',axis=0)

In [39]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

### Selecting subset of rows and columns at same time

In [42]:
# valor específico, inserimos a linha e a coluna
df.loc['A', 'W']

2

In [43]:
# múltiplas linhas e colunas
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

# Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [44]:
# boolean
df>0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True